#Напишите программу, вычисляющую 2^N.

x = int(input('введите число'))
print(2**x)
