# Напишите программу,
# которая считывает целое число и выводит текст,
# аналогичный приведенному в примере (пробелы важны!).
# пример: Введенное число 2, следующее число 3
x = int(input('введите число'))
print("Введенное число", x,
      ", следующее число ", x + 1, " ")
