# Напишите программу, которая считывает с клавиатуры строку и выводит фразу:
# «Слово [введённая строка] имеет длину [длина введённой строки]»

text = input()
print(f'Слово {text} имеет длину {len(text)}')
