# Нужно налить бассейн водой. Размеры бассейна: a, b, c м.
# Скорость, с которой наливается в него вода d м3/час.
# Определите, через сколько часов бассейн, наконец, заполнится.
# Выведите число, округлять не нужно.
a = float(input())
b = float(input())
c = float(input())
d = float(input())
print((a * b * c) / d)

