# Удава можно измерять в попугаях. Для этого даже не нужно их глотать.
# Измерьте длину строки в попугаях.
# Напишите программу, которая определяет, сколько раз слово parrot укладывается в во введенной строке.

x = input()
y = 'parrot'
print(len(x) // len(y))
