# Найдите сумму цифр введенного числа. Решите задачу в одну строку. Используйте списочное выражение.
print(sum([int(item) for item in input()]))
