#Напишите программу, которая считывает одну строку.
#Если это строка «Python», программа выводит «ДА»;
#в противном случае программа выводит «НЕТ».

x = input()
if x == "Python":
    print("ДА")
else:
    print('НЕТ')