# Напишите программу, которая считывает с клавиатуры
# текст и выводит количетсво символов:
text = input('введите текст')
length = len(text)
print('Текст:', text, 'содержит', length, "символов")
