#Напишите программу, которая определит количество символов в тексте.
#"каждый охотник желает знать где сидит фазан".

text = "каждый охотник желает знать где сидит фазан"
print("Фраза:",text,"содержит:",len(text),"сим.")