#Напишите программу, которая приветствует пользователя,
#выводя слово Hello, введенное имя и знаки препинания
# по образцу: Hello, имя!

name = input('Введите имя')
print('Hello, ', name, '!')