# Напишите программу,
# которая считывает целое число и выводит текст,
# аналогичный приведенному в примере (пробелы важны!).
# пример: Введенное число 2, следующее число 3
name = int(input('Введите число'))
print('Введенное число ',name, 'следующее число ', name+ 1)