# Напишите программу, которая считывает длины двух сторон
# в прямоугольном треугольнике и выводит его площадь по формуле:
# (1/2) * 1 сторона * 2 сторона
# Каждое число записано в отдельной строке.

b = int(input('Введите 1 сторону'))
h = int(input('Введите 2 сторону'))
print(1/2*b*h)