# Напишите программу, которая считывает длины двух сторон
# в прямоугольном треугольнике и выводит его площадь по формуле:
# (smht/2) * smht сторона * 2 сторона
# Каждое число записано в отдельной строке.
a = int(input('введите число'))
b = int(input('введите число'))
print(0.5 * a * b)
