# Задание 2.
# Напишите программу, которая считывает
# с клавиатуры последовательно два числа A и B:
# после чего выводит на экран сумму, разность, произведение,
# частное и квадрат чисел
# подсказка: int(input('введите число'))
a =int(input('введите число A'))
b =int(input('введите число B'))
print('a-b=',a-b,' a+b=',a+b,' a*b=',a*b, 'a/b=',a/b,' a^2',a*a,' b^2',b*b)