# Вася среди всех чисел с четной длиной старается найти счастливые, но считать сумму левой и правой половин числа, чтобы проверить, счастливое ли оно, ему не хочется. Помогите Васе, напишите рекурсивную функцию happy_number(), которая по введенному числу с четной длиной вернет список из двух сумм – левой и правой половин числа.
#
# Глобальные переменные использовать нельзя, а рекурсию использовать – обязательно!
#
# Пример 1
# Ввод	Вывод
# print(happy_number(12342143))
# [10, 10]
# Пример 2
# Ввод	Вывод
# print(happy_number(96251231254621))
# [28, 21]
