# Напишите программу для расчета выплат сотрудникам разных отделов.
# Вводятся строки, в которых через символ табуляции записаны:
# Фамилия и имя работника, отдел и количество выполненной им работы в условных единицах.
# В последней строке вводится число – стоимость одной условной единицы.
# Создайте файл statement.xlsx, на первом листе (Sheet_1) озаглавьте столбцы (полужирное начертание):
# employee, department, work, payment
# Затем заполните столбцы введенными данными, значение payment рассчитывается как произведение выполненной работы на стоимость условной единицы.
# На втором листе (Sheet_2) запишите в первом столбце названия всех отделов в алфавитном порядке, во втором – общее количество выполненной работы сотрудниками отдела, в третьем – общую заработанную ими сумму.
# Заголовки столбцов второго листа (полужирное начертание):
# department, total work, tota
# l cost