# Три раза в месяц на Луну из Солнечного города улетает ракета. Это всегда происходит строго по расписанию кроме тех дней, в которые вылет приходится на четверг. Четверг — сырный день, а Луна очень похожа на сыр с аппетитными дырками. Вылет приходится переносить на ближайшую субботу. Ну и прямо сегодня точно не полетим.
#
# Напишите функцию days_to_the_next_flight(first, second, third), принимающую номера дней любого месяца, на которые запланирован полет, и возвращающую количество дней до ближайшего запуска ракеты с учетом правил переноса (считать нужно от сегодняшней даты, используйте библиотеку datetime).
#
# Пример 1
# Ввод	Вывод
# 9 16 23
# 10
# Пример 2
# Ввод	Вывод
# 31 1 29
# 28

