# Организуйте вывод памятки для начинающего программиста. Вам нужно написать программу так, чтобы расчет значения в последней строке выполнялся непосредственно перед ее выводом и подставлялся вместо ХХХХ.
# 1 бит - минимальная единица количества информации.
# 1 байт = 8 бит.
# 1 Килобит = 1024 бита.
# 1 Килобайт = 1024 байта.
# 1 Килобайт = ХХХХ бит.
print("1 бит - минимальная единица количества информации.")
print("1 байт = 8 бит.")
print("1 Килобит = 1024 бита.")
print("1 Килобайт = 1024 байта.")
print("1 Килобайт =", 1024 * 8, "бит.")
