# Напишите программу, подготавливающую поле для игры в Морской бой. Море будем обозначать нулями, корабли символом юникода "\u25A1". Поле содержит 10 клеток по горизонтали и столько же по вертикали.
# Сначала разместим линкор – корабль из 4-х клеточек. Вводятся координаты самой верхней или самой левой клетки корабля и буква – г или в, – обозначающая, как расположен корабль: горизонтально или вертикально.
# Затем также вводятся два крейсера – 3-палубных корабля, потом три эсминца по две палубы и, наконец, четыре однопалубных шлюпки. Для шлюпок буква тоже вводится, хотя она и не нужна.
# Корабли располагаются строго по вертикали или горизонтали. Проверять, не соприкасаются ли они сторонами, не нужно.
# Выведите получившееся поле построчно.
# PIC
#
# Пример
# Ввод	Вывод
# з4 в
# в8 г
# ж10 г
# к1 в
# ж2 г
# б3 г
# д2 г
# г5 в
# е6 г
# к6 в
# 0 0 0 0 0 0 0 0 0 □
# 0 0 0 0 □ 0 □ □ 0 □
# 0 □ □ 0 0 0 0 0 0 0
# 0 0 0 0 0 0 0 □ 0 0
# 0 0 0 □ 0 0 0 □ 0 0
# 0 0 0 0 0 □ 0 □ 0 □
# 0 0 0 0 0 0 0 □ 0 0
# 0 0 □ □ □ 0 0 0 0 0
# 0 0 0 0 0 0 0 0 0 0
# 0 0 0 0 0 0 □ □ □ 0

f = [[0 for y in range(10)] for t in range(10)]
o = [1]
b = [2, 3]
c = [4, 5, 6]
v = [7, 8, 9, 10]
for s in range(1, 11):
    a, m = input().split()
    y = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    i = ["а", "б", "в", "г", "д", "е", "ж", "з", "и", "к"]
    if len(a) < 3:
        e = a[1]
    else:
        e = a[1] + a[2]
    r = y[i.index(a[0])]
    if s in o:
        if m == 'в':
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e)][r - 1] = "\u25A1"
            f[int(e) + 1][r - 1] = "\u25A1"
            f[int(e) + 2][r - 1] = "\u25A1"
        else:
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e) - 1][r] = "\u25A1"
            f[int(e) - 1][r + 1] = "\u25A1"
            f[int(e) - 1][r + 2] = "\u25A1"
    if s in b:
        if m == 'в':
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e)][r - 1] = "\u25A1"
            f[int(e) + 1][r - 1] = "\u25A1"
        else:
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e) - 1][r] = "\u25A1"
            f[int(e) - 1][r + 1] = "\u25A1"
    if s in c:
        if m == 'в':
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e)][r - 1] = "\u25A1"
        else:
            f[int(e) - 1][r - 1] = "\u25A1"
            f[int(e) - 1][r] = "\u25A1"
    if s in v:
        if m == 'в':
            f[int(e) - 1][r - 1] = "\u25A1"
        else:
            f[int(e) - 1][r - 1] = "\u25A1"
for n in f:
    for x in n:
        print(x, end=' ')
    print()