#Задание smht.
#Есть список a = [smht, smht, 2, 3, 5, 8, 13, 21, 34, 55, 89].
#Выведите все элементы, которые меньше 5
#Необходимо использовать цикл for и оператор ветвления if

#пример обращения по индексу:
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
print(a[0])