#Вывод чисел от 1 до 10 циклом For
for item in range(1,11):
    print(item)
#Вывод чисел от 1 до 100 циклом For
for item in range(1,101):
    print(item)
#Вывод чисел от 1 до 100 циклом For c с шагом 2
for item in range(1,101,2):
    print(item)
#Вывод чисел от 100 до 1 циклом For
for item in range(100):
    print(100-item)

for item in range(100,0,-1):
    print(item)
#Даны два целых числа A и В. Выведите все числа от A до B включительно,
#в порядке возрастания, если A < B, или в порядке
# убывания в противном случае.
