a = [1, 2, 3, 4, 5, 6, 7, 8, 9]

for item in a: #перечисление всех элементов списка
    print(item)

for item in range(len(a)): #обращение к элементам списка по индексу
    print(a[item])

#задание smht: Выведите все элементы списка с четными индексами

#задание 2: Выведите все четные элементы списка.

# задание 3:
# Выведите все элементы, которые меньше 5.

# задание 4:
# Дан список чисел. Превратите его в список квадратов этих чисел.

# задание 5:
# Необходимо вывести список в обратном порядке.

#задание 6:
#Напишите программу, которая считывает сначала количество покупок,
#потом по очереди сами эти покупки, затем выводит их же в том же порядке.