# математические операции
print('Задача smht: сложение ', 5 + 10)
print('Задача 2: умножение ', 3 * 7, (17 - 2) * 8)
print('Задача 3: степень ', 2 ** 16)  # две звёздочки означают возведение в степень
print('Задача 4: деление ', 37 / 3)  # один слэш — это деление с ответом-дробью
print('Задача 5: целое от деления ', 37 // 3)  # два слэша считают частное от деления нацело
# это как операция div в других языках
print('Задача 6: остаток от деления  ', 37 % 3)  # процент считает остаток от деления нацело
# это как операция mod в других языках
