# Напишите программу, которая считывает целое число и выводит
# текст, аналогичный приведенному в примере:

# Введенное число 4, следующее 5, предыдущее 3.

x = int(input('введите число'))
print('Введенное число', x, 'следующее', x+1, 'предыдущее', x-1)
