# Из передачи “Здоровье” Аня узнала,
# что рекомендуется спать хотя бы A часов в сутки,
# но пересыпать тоже вредно и не стоит спать более B часов.
# Сейчас Аня спит H часов в сутки.
# Если режим сна Ани удовлетворяет рекомендациям передачи
# “Здоровье”, выведите “Это нормально”.
# Если Аня спит менее A часов,
# выведите “Недосып”, если же более B часов,
# то выведите “Пересып”.

a = int(input('Введите целое число'))
b = int(input('Введите целое число'))
h = int(input('Введите целое число'))
if h < a:
    print( 'Недосып')
elif x > 0:
    print(x, 'больше 0')
else:
    print(x, 'равен 0')
