# На фабрике перед отгрузкой покупателю производят контроль качества изделий. Для этого из каждой партии берут наугад несколько деталей и проверяют их. Если среди проверенных оказалось хотя бы одно некачественное изделие, вся партия считается браком. Если все партии бракованные, отгрузку останавливают и проводят более детальную проверку.
#
# Формат ввода
# Вводятся строки чисел, записанных через точку с запятой и пробел. Каждая строка – партия изделий.
#
# Формат вывода
# Некачественными считаются числа, кратные 5. Если в партии нет таких чисел, она качественная.
# Если во всех партиях есть хотя бы одно некачественное изделие, выведите FAIL, иначе OK.
# В задаче обязательно используйте all, any.
#
# Пример 1
# Ввод	Вывод
# 1; 2; 3; 7; 4
# 3; 2; 1; 10; 1
# 2; 0; 3; 1; 2; 2
# OK

print(('OK', 'FAIL')[all([any(map(lambda x: x != 0 and not x % 5, map(int, i.split('; ')))) for i in iter(input, '')])])
