# На брезентовом прямоугольном поле растут только вечнозеленые помидоры и алюминиевые огурцы. Считается, что это помидорное поле, если в каждом ряду помидоров не меньше, чем огурцов.
#
# На грядке огурцы – это любые числа, содержащие ноль, помидоры – все остальные.
#
# Определите, можно ли считать поле помидорным (EVERGREEN TOMATOES). Или огурцовым (ALUMINUM CUCUMBERS). И выведите свой вердикт.
#
# Формат ввода
# Вводятся строки чисел, записанных через пробел. Каждая строка – грядка с помидорами и огурцами.
#
# Формат вывода
# Если поле можно считать помидорным, выведите (EVERGREEN TOMATOES). Если огурцовым – (ALUMINUM CUCUMBERS).
# В задаче обязательно используйте all, any или функции высшего порядка.
#
# Пример 1
# Ввод	Вывод
# 1 3 6 20
# 2 2 10 70 50
# 20 10 1
# ALUMINUM CUCUMBERS
# Пример 2