# Отсортируйте список радиодеталей сначала по размеру по убыванию, затем по типу по алфавиту, затем по номиналу по возрастанию.
#
# Формат ввода
# Вводится количество деталей, затем сами детали в виде строк, в которых через запятую и пробел записан тип, размер и номинал детали. Размер – целое число, номинал – вещественное.
#
# Формат вывода
# Выведите отсортированные детали в формате:
# тип: номинал; размер
#
# Пример
# Ввод	Вывод
# 8
# resistor, 2, 2.2
# capacitor, 5, 4.7
# resistor, 1, 2.2
# resistor, 2, 6.2
# diode, 4, 1.5
# inductor, 3, 1.5
# capacitor, 5, 3.9
# lamp, 1, 6.8
# capacitor: 3.9; 5
# capacitor: 4.7; 5
# diode: 1.5; 4
# inductor: 1.5; 3
# resistor: 2.2; 2
# resistor: 6.2; 2
# lamp: 6.8; 1
# resistor: 2.2; 1

