# Разные металлы имеют разные температуры плавления. На Венере так жарко, что по ее поверхности вполне могли бы течь свинцовые реки, если бы там было так много свинца. А цезий или галлий плавятся при температуре чуть выше комнатной, около 30 градусов Цельсия. Чтобы ртуть стала твёрдой, нужны морозы ниже 39 градусов. Бр-р-р-р!
#
# Да, кстати. Температуру физики предпочитают измерять в Кельвинах (K), по абсолютной шкале температур. Перевод из градусов по Цельсию (C) в Кельвины можно сделать так:
#
# T = t + 273.15
#
# где t – температура по Цельсию.
#
# Хорошо бы написать программу, которая определит, какие из введённых веществ при данной температуре уже расплавились.
#
# Формат ввода
# Вводятся строки вида:
# {Вещество} {температура плавления} {единицы измерения}
#
# В последней строке температура и единицы измерения.
#
# Формат вывода
# Нужно вывести те вещества, которые при этой температуре находятся в жидком состоянии, каждое с новой строки. Без повторений. В любом порядке.
#
# Пример 1
# Ввод	Вывод
# Серебро 960.0 C
# Золото 1063.0 C
# Медь 1356.0 K
# Железо 1539.0 C
# Кремний 1688.0 K
# Никель 1455.0 C
# 1200 C
# Серебро
# Золото
# Медь

