# Напишите программу, которая считывает три строки. Если эти три строки – «раз», «два» и «три», то программа выводит «ГОРИ», если нет, то «НЕ ГОРИ».
x = input()
y = input()
z = input()
if (x == 'раз') and (y == 'два') and (z == 'три'):
    print("ГОРИ")
else:
    print("НЕ ГОРИ")
