# Напишите функцию sorting(), сортирующую значения списка в переменной data. Функция вызывается без аргументов, ничего не выводит и ничего не возвращает, только меняет расположение значений в переменной.
#
# Пример 1
# Ввод	Вывод
# data = [5, 6, 48, 2]
# sorting()
# print(data)
# [2, 5, 6, 48]
# Пример 2
# Ввод	Вывод
# data = ['q', 'w', 'e', 'r', 't', 'y']
# sorting()
# print(data)
# ['e', 'q', 'r', 't', 'w', 'y']
# Примечания
# В задаче нельзя использовать инструкцию global.

def sorting():
    data.sort()
