# Напишите функцию sorting_triple(), которая сортирует значения списка во внешней переменной data (значения могут быть различных типов – строки, целые или вещественные числа – при разных вызовах функции, но внутри одного списка – тип один). Функция принимает аргументы – key и reverse. Значения аргумента key могут быть abc (сортировка по значению: строки сортируются как строки, числа как числа) и len (сортировка по длине, при одинаковой длине порядок не меняется); значения аргумента reverse могут быть False и True, соответственно не изменяет порядок сортировки или меняет на обратный.
#
# Функция ничего не выводит и ничего не возвращает, только меняет расположение значений в переменной.
#
# Пример 1
# Ввод	Вывод
# data = [5, 16, 148, 2]
# sorting_triple("len", True)
# print(data)
# [148, 16, 5, 2]

